package com.javarush.task.task32.task3209;

import javax.swing.*;
import java.awt.event.ActionListener;

//вспомогательный класс для инициализации и настройки меню
public class MenuHelper {

    //parent - меню в которое мы добавляем пункт
    // text - текст добавляемого пункта
    // actionListener - слушатель действий добавляемого пункта меню
    public static JMenuItem addMenuItem(JMenu parent, String text, ActionListener actionListener) {
        return null;
    }

}



    /*У меню будет следующая структура:
        - Файл
        - Новый
        - Открыть
        - Сохранить
        - Сохранить как...
        - Выход

        - Редактировать
        - Отменить
        - Вернуть
        - Вырезать
        - Копировать
        - Вставить

        - Стиль
        - Полужирный
        - Подчеркнутый
        - Курсив
        - Подстрочный знак
        - Надстрочный знак
        - Зачеркнутый

        - Выравнивание
        - По левому краю
        - По центру
        - По правому краю

        - Цветv
        - Красный
        - Оранжевый
        - Желтый
        - Зеленый
        - Синий
        - Голубой
        - Пурпурный
        - Черный

        - Шрифт
        - Шрифт
        - SansSerif, Serif, Monospaced, Dialog, DialogInput,
        - Размер шрифта
        - 6, 8, 10, 12, 14, 16, 20, 24, 32, 36, 48, 72

        - Помощь
        - О программе*/